In [2]:
import numpy as np

In [3]:
np.ones([5,5])

array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]])

In [4]:
x = np.array([1,2,3,4])
x

array([1, 2, 3, 4])

In [9]:
np.split(x,4)

[array([1]), array([2]), array([3]), array([4])]

### Pandas

In [10]:
import pandas as pd
import numpy as np

In [11]:
x=[1,2,3,4,5]
x=pd.Series(x)
x

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
x = [1,2,3,4,5]
x = pd.Series(x,index=['a','b','c','d','e'])
x

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [18]:
print(x[1])

2

In [19]:
# Multi Index  홍길동, 이몽룡 내용

In [22]:
x = [1,None,2,None,3,4,None]
x=pd.Series(x)
x

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
5    4.0
6    NaN
dtype: float64

In [26]:
print(x.isnull())

0    False
1     True
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [28]:
print(x.notnull())

0     True
1    False
2     True
3    False
4     True
5     True
6    False
dtype: bool

In [32]:
x.dropna(inplace=True)  # inplace=True넣어주면 원본 x를 바꿔줄 수 있음
x

0    1.0
2    2.0
4    3.0
5    4.0
dtype: float64

In [33]:
x.fillna(0)
x

0    1.0
2    2.0
4    3.0
5    4.0
dtype: float64

In [34]:
x = pd.Series([1,2,3])
y = pd.Series([4,5,6])
z = pd.Series([7,8,9])

pd.concat([x,y,z])

0    1
1    2
2    3
0    4
1    5
2    6
0    7
1    8
2    9
dtype: int64

In [35]:
pd.concat([x,y,z],verify_integrity=True)   # 인덱스 겹쳐서 오류

ValueError: Indexes have overlapping values: Int64Index([0, 1, 2], dtype='int64')

In [36]:
pd.concat([x,y,z],ignore_index=True)   # 인덱스 다시 배열

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [37]:
pd.concat([x,y,z],ignore_index=True,axis=1)

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [38]:
x = pd.Series([1,2,3,4])
y = pd.Series([4,5,6])
z = pd.Series([7,8,9])

pd.concat([x,y,z],ignore_index=True,axis=1,join='inner')

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [39]:
pd.concat([x,y,z],ignore_index=True,axis=1,join='outer')

   0    1    2
0  1  4.0  7.0
1  2  5.0  8.0
2  3  6.0  9.0
3  4  NaN  NaN

In [43]:
pd.concat([x,y,z],ignore_index=True,axis=1,join='outer')

   0    1    2
0  1  4.0  7.0
1  2  5.0  8.0
2  3  6.0  9.0
3  4  NaN  NaN

In [62]:
# 실습01
x = [np.nan,1,2,3,4,5]
x

[nan, 1, 2, 3, 4, 5]

In [63]:
y = pd.Series([x[np.random.randint(0,6)] for i in range(20)])
y                    #개수 6개니까 (0,6)

0     1.0
1     4.0
2     5.0
3     NaN
4     4.0
5     3.0
6     5.0
7     NaN
8     4.0
9     2.0
10    4.0
11    NaN
12    5.0
13    1.0
14    5.0
15    4.0
16    3.0
17    1.0
18    NaN
19    5.0
dtype: float64

In [64]:
#실습01 1. 결측값의 갯수
print(y.isnull().sum())

4

In [65]:
#실습01 2. 결측값 제거
y.dropna()

0     1.0
1     4.0
2     5.0
4     4.0
5     3.0
6     5.0
8     4.0
9     2.0
10    4.0
12    5.0
13    1.0
14    5.0
15    4.0
16    3.0
17    1.0
19    5.0
dtype: float64

In [66]:
#실습01 3. 결측값에 y의 평균값을 넣은 Series
y.fillna(y.dropna().mean())

0     1.0
1     4.0
2     5.0
3     3.5
4     4.0
5     3.0
6     5.0
7     3.5
8     4.0
9     2.0
10    4.0
11    3.5
12    5.0
13    1.0
14    5.0
15    4.0
16    3.0
17    1.0
18    3.5
19    5.0
dtype: float64

In [69]:
y.ffill()  # 결측값을 앞에 값으로 채워줌

0     1.0
1     4.0
2     5.0
3     5.0
4     4.0
5     3.0
6     5.0
7     5.0
8     4.0
9     2.0
10    4.0
11    4.0
12    5.0
13    1.0
14    5.0
15    4.0
16    3.0
17    1.0
18    1.0
19    5.0
dtype: float64

In [70]:
y.bfill()   # 결측값을 뒤의 값으로 채워줌

0     1.0
1     4.0
2     5.0
3     4.0
4     4.0
5     3.0
6     5.0
7     4.0
8     4.0
9     2.0
10    4.0
11    5.0
12    5.0
13    1.0
14    5.0
15    4.0
16    3.0
17    1.0
18    5.0
19    5.0
dtype: float64

In [73]:
sales_data = {
'연도':[2015, 2016, 2017, 2018, 2019, 2020],  # 열이 됨, 연도는 column명
'판매량':[103, 70, 130, 160, 190, 230],   # 열이 됨, 판매량도 columnaud
'매출':[500000, 300000, 400000, 550000, 700000, 680000],
'순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}
df = pd.DataFrame(sales_data)
df   # 인덱스도 같이 나옴

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [74]:
df.head(2)

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000

In [75]:
df.tail(2)

     연도  판매량      매출     순이익
4  2019  190  700000  600000
5  2020  230  680000  590000

In [76]:
df['판매량']   # 시리즈가 됨

0    103
1     70
2    130
3    160
4    190
5    230
Name: 판매량, dtype: int64

In [77]:
type(df['판매량'])

pandas.core.series.Series

In [132]:
# 행렬로 조회하고 싶을 때

df.iloc[1]  # 인덱스 1에 대한 값

연도       2016
판매량        70
매출     300000
순이익    190000
Name: 1, dtype: int64

In [133]:
df.iloc[1].index    # 인덱스 조회 가능

Index(['연도', '판매량', '매출', '순이익'], dtype='object')

In [134]:
# 필요한 것만 계산
df2 = pd.DataFrame(sales_data, columns=['판매량', '매출','순이익'], index=df['연도'])
df2

      판매량      매출     순이익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018  160  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [135]:
df2.iloc[2]    # 직접 연도 입력해서 판매량, 매출, 순이익 조회하려면?

판매량       130
매출     400000
순이익    300000
Name: 2017, dtype: int64

In [136]:
type(df['연도'])

pandas.core.series.Series

In [129]:
type(sales_data)

dict

In [140]:
type(df2)

pandas.core.frame.DataFrame

In [146]:
type(df['연도'])

pandas.core.series.Series

In [142]:
df2.index

Int64Index([2015, 2016, 2017, 2018, 2019, 2020], dtype='int64', name='연도')

In [143]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [156]:
df = pd.read_csv('sales_data.csv', index_col='연도',header=0) #연도를 인덱스로 삼겠다  아까 df2와 같은 결과

In [157]:
df  #csv에서 읽은 텍스트가 데이터프레임으로 바뀜

      판매량      매출      순익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018   60  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [164]:
df.to_csv('sales_data_save.csv')

In [165]:
df

      판매량      매출      순익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018   60  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [166]:
sales_data = {
'연도':[2015, 2016, 2017, 2018, 2019, 2020],  # 열이 됨, 연도는 column명
'판매량':[103, 70, 130, 160, 190, 230],   # 열이 됨, 판매량도 columnaud
'매출':[500000, 300000, 400000, 550000, 700000, 680000],
'순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}
df = pd.DataFrame(sales_data)
df   # 인덱스도 같이 나옴

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [167]:
df['순이익률'] = df['순이익']/df['매출'] * 100   #추가할 수 있음. 계산은 넘파이로 된 것
df

     연도  판매량      매출     순이익       순이익률
0  2015  103  500000  370000  74.000000
1  2016   70  300000  190000  63.333333
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706

In [168]:
def check(n):
    if n>80:
        return '높음'
    else:
        return '낮음'

In [183]:
del df['순이익률 비교']
df

     연도  판매량      매출     순이익       순이익률
0  2015  103  500000  370000  74.000000
1  2016   70  300000  190000  63.333333
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706

In [184]:
df['순이익률 비교'] = list(map(lambda x : '높음' if x>80 else '낮음', df['순이익률']))

In [185]:
df

     연도  판매량      매출     순이익       순이익률 순이익률 비교
0  2015  103  500000  370000  74.000000      낮음
1  2016   70  300000  190000  63.333333      낮음
2  2017  130  400000  300000  75.000000      낮음
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음

In [189]:
df['순이익률 비교'] = df['순이익률'].apply(lambda x : '높음' if x>80 else '낮음')
df  #check 대신 lambda를 쓴 것으로 생각

     연도  판매량      매출     순이익       순이익률 순이익률 비교
0  2015  103  500000  370000  74.000000      낮음
1  2016   70  300000  190000  63.333333      낮음
2  2017  130  400000  300000  75.000000      낮음
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음

In [191]:
df[df['매출']>500000]

     연도  판매량      매출     순이익       순이익률 순이익률 비교
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음

In [192]:
df['테스트1'] = np.where(df['판매량']>200,0,df['판매량'])
df

     연도  판매량      매출     순이익       순이익률 순이익률 비교  테스트1
0  2015  103  500000  370000  74.000000      낮음   103
1  2016   70  300000  190000  63.333333      낮음    70
2  2017  130  400000  300000  75.000000      낮음   130
3  2018  160  550000  480000  87.272727      높음   160
4  2019  190  700000  600000  85.714286      높음   190
5  2020  230  680000  590000  86.764706      높음     0

In [198]:
df['테스트2'] = df[df['판매량']<150]['판매량']+50
df

     연도  판매량      매출     순이익       순이익률 순이익률 비교  테스트1   테스트2
0  2015  103  500000  370000  74.000000      낮음   103  153.0
1  2016   70  300000  190000  63.333333      낮음    70  120.0
2  2017  130  400000  300000  75.000000      낮음   130  180.0
3  2018  160  550000  480000  87.272727      높음   160    NaN
4  2019  190  700000  600000  85.714286      높음   190    NaN
5  2020  230  680000  590000  86.764706      높음     0    NaN

In [206]:
sales_data = {
'연도':[2015, 2016, 2017, 2018, 2019, 2020],  # 열이 됨, 연도는 column명
'판매량':[103, 70, 130, 160, 190, 230],   # 열이 됨, 판매량도 columnaud
'매출':[500000, 300000, 400000, 550000, 700000, 680000],
'순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}
df = pd.DataFrame(sales_data)
df   # 인덱스도 같이 나옴

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [207]:
df.loc[6] = [2021, 720, 650000, 360000]
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000
6  2021  720  650000  360000

In [209]:
df.loc[7] = df.loc[5]+100
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000
6  2021  720  650000  360000
7  2120  330  680100  590100

In [210]:
df['순이익률'] = df['순이익']/df['매출'] * 100   #추가할 수 있음. 계산은 넘파이로 된 것
df

     연도  판매량      매출     순이익       순이익률
0  2015  103  500000  370000  74.000000
1  2016   70  300000  190000  63.333333
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706
6  2021  720  650000  360000  55.384615
7  2120  330  680100  590100  86.766652

In [211]:
df['순이익률 비교'] = df['순이익률'].apply(lambda x : '높음' if x>80 else '낮음')
df  #check 대신 lambda를 쓴 것으로 생각

     연도  판매량      매출     순이익       순이익률 순이익률 비교
0  2015  103  500000  370000  74.000000      낮음
1  2016   70  300000  190000  63.333333      낮음
2  2017  130  400000  300000  75.000000      낮음
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음
6  2021  720  650000  360000  55.384615      낮음
7  2120  330  680100  590100  86.766652      높음

In [212]:
df.loc[8] = df.loc[7]+100   #높음, 낮음에 +100 안되기 때문

TypeError: can only concatenate str (not "int") to str

In [213]:
del df['순이익률 비교']
df

     연도  판매량      매출     순이익       순이익률
0  2015  103  500000  370000  74.000000
1  2016   70  300000  190000  63.333333
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706
6  2021  720  650000  360000  55.384615
7  2120  330  680100  590100  86.766652

In [220]:
df.drop(['순이익률'],axis=1,inplace=True)  # 원본도 적용하려면 inplace=True

In [221]:
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000
6  2021  720  650000  360000
7  2120  330  680100  590100

In [224]:
df.drop(df.columns[[0,2]],axis=1)

   판매량     순이익
0  103  370000
1   70  190000
2  130  300000
3  160  480000
4  190  600000
5  230  590000
6  720  360000
7  330  590100

In [225]:
df.drop(0,inplace=True)
df

     연도  판매량      매출     순이익
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000
6  2021  720  650000  360000
7  2120  330  680100  590100

In [226]:
df.drop(0,inplace=True)   #0번 인덱스가 이미 지워졌기 때문
df

KeyError: '[0] not found in axis'

In [227]:
df.drop([3,4,5],inplace=True)
df

     연도  판매량      매출     순이익
1  2016   70  300000  190000
2  2017  130  400000  300000
6  2021  720  650000  360000
7  2120  330  680100  590100

In [232]:
df = pd.DataFrame(np.random.randint(1,100,size=(4,4)),index=[['A','A','B','B'],['a','a','b','b']], columns=[['가가','가가','나나','나나'],['가','나','가','나']])

df

     가가      나나
      가   나   가   나
A a  83  62  71  98
  a  53  88  79  63
B b  79  56  33  74
  b  30  42  54  22

In [233]:
df.columns

MultiIndex([('가가', '가'),
            ('가가', '나'),
            ('나나', '가'),
            ('나나', '나')],
           )

In [234]:
df.index

MultiIndex([('A', 'a'),
            ('A', 'a'),
            ('B', 'b'),
            ('B', 'b')],
           )

In [236]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)), index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],['사과','배','바나나','사과','사과','배','바나나','배']], columns=['판매','재고'])

In [238]:
df

         판매  재고
A창고 사과   31  76
    배    87  30
    바나나  44   9
    사과   43  62
B창고 사과   71  77
    배    21  37
    바나나  43  14
    배    49  61

In [239]:
df.index.names = ['창고명','상품명']

In [241]:
df

         판매  재고
창고명 상품명
A창고 사과   31  76
    배    87  30
    바나나  44   9
    사과   43  62
B창고 사과   71  77
    배    21  37
    바나나  43  14
    배    49  61

In [242]:
df.groupby('창고명').sum()

      판매   재고
창고명
A창고  205  177
B창고  184  189

In [243]:
df.groupby('상품명').sum()

      판매   재고
상품명
바나나   87   23
배    157  128
사과   145  215

In [244]:
df.groupby(['창고명','상품명']).sum()

         판매   재고
창고명 상품명
A창고 바나나  44    9
    배    87   30
    사과   74  138
B창고 바나나  43   14
    배    70   98
    사과   71   77

In [245]:
df

         판매  재고
창고명 상품명
A창고 사과   31  76
    배    87  30
    바나나  44   9
    사과   43  62
B창고 사과   71  77
    배    21  37
    바나나  43  14
    배    49  61

In [248]:
df.groupby('창고명')

In [251]:
df = pd.DataFrame({'Animal':['Falcon','Falcon','Parrot','Parrot'], 'Max Speed':[380,370,24,36]})
df

   Animal  Max Speed
0  Falcon        380
1  Falcon        370
2  Parrot         24
3  Parrot         36

In [254]:
df.groupby(['Animal']).sum()

        Max Speed
Animal
Falcon        750
Parrot         60

In [255]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon        375
Parrot         30

In [256]:
df.groupby(['Animal']).count()

        Max Speed
Animal
Falcon          2
Parrot          2

In [257]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)), index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],['사과','배','바나나','사과','사과','배','바나나','배']], columns=['판매','재고'])
df

         판매  재고
A창고 사과   92   9
    배    37  82
    바나나  63  23
    사과   92  45
B창고 사과   27  26
    배    22  34
    바나나  32  69
    배    58  73

In [259]:
df.index.names = ['창고명','상품명']
df.groupby('상품명').sum()

      판매   재고
상품명
바나나   95   92
배    117  189
사과   211   80

In [260]:
df.groupby(['창고명','상품명']).sum()

          판매   재고
창고명 상품명
A창고 바나나   63   23
    배     37   82
    사과   184   54
B창고 바나나   32   69
    배     80  107
    사과    27   26

In [261]:
df=pd.DataFrame(np.random.randint(1,100,size=(8,2)),index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],['사과','배','바나나','사과','사과','배','바나나','배']],columns=['판매','재고'])
df

         판매  재고
A창고 사과   24  48
    배    20  67
    바나나  82  10
    사과   14  52
B창고 사과   94   6
    배    62  67
    바나나  58  76
    배    82  47

In [264]:
df.sort_values(by=['판매','재고'],ascending=[True,False])  #판매 오름차순한 것

         판매  재고
A창고 사과   14  52
    배    20  67
    사과   24  48
B창고 바나나  58  76
    배    62  67
    배    82  47
A창고 바나나  82  10
B창고 사과   94   6

In [14]:
#실습02 1. 데이터 프레임 생성
import numpy as np
import pandas as pd

practice2 = pd.DataFrame(np.random.randint(1,100,size=(15,3)),index=[['1학년','1학년','1학년','1학년','1학년','2학년','2학년','2학년','2학년','2학년','3학년','3학년','3학년','3학년','3학년'],['1반','2반','3반','4반','5반','1반','2반','3반','4반','5반','1반','2반','3반','4반','5반']],columns=['국어','영어','과학'])
practice2

        국어  영어  과학
1학년 1반  19  72  15
    2반  70  22  83
    3반  58  22  93
    4반  68  44  31
    5반  53  71  12
2학년 1반  63  32  57
    2반  19  69  31
    3반  30  22  84
    4반  54  88  83
    5반  18  56  52
3학년 1반  27  14   8
    2반   9  92  28
    3반  72   3  35
    4반  88  24  62
    5반  41  91  10

In [37]:
#실습02 2. 반별 합계와 평균 추가
practice2['총점'] = sum((practice2['국어'], practice2['영어'], practice2['과학']))
practice2['평균'] = (practice2['국어']+practice2['영어']+practice2['과학'])/3
practice2

        국어  영어  과학   총점         평균
1학년 1반  19  72  15  106  35.333333
    2반  70  22  83  175  58.333333
    3반  58  22  93  173  57.666667
    4반  68  44  31  143  47.666667
    5반  53  71  12  136  45.333333
2학년 1반  63  32  57  152  50.666667
    2반  19  69  31  119  39.666667
    3반  30  22  84  136  45.333333
    4반  54  88  83  225  75.000000
    5반  18  56  52  126  42.000000
3학년 1반  27  14   8   49  16.333333
    2반   9  92  28  129  43.000000
    3반  72   3  35  110  36.666667
    4반  88  24  62  174  58.000000
    5반  41  91  10  142  47.333333

In [38]:
#실습02 3. 인덱스명 추가 및 학년별 그룹 합계 출력
practice2.index.names = ['학년','반']
practice2.groupby('학년').sum()

      국어   영어   과학   총점          평균
학년
1학년  268  231  234  733  244.333333
2학년  184  267  307  758  252.666667
3학년  237  224  143  604  201.333333

In [40]:
# 총점 평균 구하기
practice2

        국어  영어  과학   총점         평균
학년  반
1학년 1반  19  72  15  106  35.333333
    2반  70  22  83  175  58.333333
    3반  58  22  93  173  57.666667
    4반  68  44  31  143  47.666667
    5반  53  71  12  136  45.333333
2학년 1반  63  32  57  152  50.666667
    2반  19  69  31  119  39.666667
    3반  30  22  84  136  45.333333
    4반  54  88  83  225  75.000000
    5반  18  56  52  126  42.000000
3학년 1반  27  14   8   49  16.333333
    2반   9  92  28  129  43.000000
    3반  72   3  35  110  36.666667
    4반  88  24  62  174  58.000000
    5반  41  91  10  142  47.333333

In [41]:
del practice2['총점']
del practice2['평균']

In [42]:
practice2['총점'] = practice2.sum(axis=1)

In [43]:
practice2

        국어  영어  과학   총점
학년  반
1학년 1반  19  72  15  106
    2반  70  22  83  175
    3반  58  22  93  173
    4반  68  44  31  143
    5반  53  71  12  136
2학년 1반  63  32  57  152
    2반  19  69  31  119
    3반  30  22  84  136
    4반  54  88  83  225
    5반  18  56  52  126
3학년 1반  27  14   8   49
    2반   9  92  28  129
    3반  72   3  35  110
    4반  88  24  62  174
    5반  41  91  10  142

In [47]:
practice2['평균'] = practice2['총점']/3

In [48]:
practice2

        국어  영어  과학   총점         평균
학년  반
1학년 1반  19  72  15  106  35.333333
    2반  70  22  83  175  58.333333
    3반  58  22  93  173  57.666667
    4반  68  44  31  143  47.666667
    5반  53  71  12  136  45.333333
2학년 1반  63  32  57  152  50.666667
    2반  19  69  31  119  39.666667
    3반  30  22  84  136  45.333333
    4반  54  88  83  225  75.000000
    5반  18  56  52  126  42.000000
3학년 1반  27  14   8   49  16.333333
    2반   9  92  28  129  43.000000
    3반  72   3  35  110  36.666667
    4반  88  24  62  174  58.000000
    5반  41  91  10  142  47.333333

In [50]:
practice2.groupby('학년').sum()

      국어   영어   과학   총점          평균
학년
1학년  268  231  234  733  244.333333
2학년  184  267  307  758  252.666667
3학년  237  224  143  604  201.333333

In [110]:
#실습03
titanic_train = pd.read_csv('titanic_train.csv',header=0)
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [121]:
#실습03 1. 결측치 처리
titanic_train['Age'].fillna(titanic_train['Age'].mean(),inplace=True)
titanic_train['Cabin'].fillna('N',inplace=True)
titanic_train['Embarked'].fillna('N',inplace=True)
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Range
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,N,S,20대
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C,30대
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,N,S,20대
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S,30대
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,N,S,30대
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,N,S,20대
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S,10대
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,N,S,노인
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C,20대
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,N,Q,30대

In [136]:
sursived_sum = titanic_train.groupby('Sex').sum()
sursived_sum.drop(['Age','Pclass','Parch','Fare','PassengerId','SibSp'],axis=1)

        Survived
Sex
female       233
male         109

In [135]:
class_sum = titanic_train.groupby('Pclass').sum()
class_sum.drop(['Age','Parch','Fare','PassengerId','SibSp'],axis=1)

        Survived
Pclass
1            136
2             87
3            119

In [124]:
def check(a):
    if a<10:
        return '유아'
    elif a<20:
        return '10대'
    elif a<30:
        return '20대'
    elif a<40:
        return '30대'
    elif a<50:
        return '40대'
    elif a<60:
        return '50대'
    elif a<70:
        return '60대'
    else:
        return '노인'

titanic_train['Age_Range'] = titanic_train['Age'].apply(check)
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Range
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,N,S,20대
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C,30대
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,N,S,20대
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S,30대
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,N,S,30대
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,N,S,20대
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S,10대
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,N,S,20대
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C,20대
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,N,Q,30대

In [125]:
Age_sum = titanic_train.groupby('Age_Range').sum()
Age_sum.drop(['Age','Parch','Fare','PassengerId','SibSp','Pclass'],axis='columns')

           Survived
Age_Range
10대              41
20대             129
30대              73
40대              34
50대              20
60대               6
노인                1
유아               38

In [128]:
#실습03 강사님 모범답안
# titanic_train.info()  데이터 정보 확인

In [133]:
#그룹별 생존자 확인 간단하게 하는법
titanic_train.groupby('Sex')['Survived'].sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

In [137]:
#클래스별 생존자 확인 간단하게 하는법
titanic_train.groupby('Pclass')['Survived'].sum()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [138]:
#나이대별 생존자 확인 간단하게 하는법
titanic_train.groupby('Age_Range')['Survived'].sum()

Age_Range
10대     41
20대    129
30대     73
40대     34
50대     20
60대      6
노인       1
유아      38
Name: Survived, dtype: int64

In [15]:
#교재 240p. 날짜 데이터 생성
import pandas as pd
import numpy as np
for date in pd.date_range(start='2019-01-01',end='2019-01-07'):
    print(date)

2019-01-01 00:00:00
2019-01-02 00:00:00
2019-01-03 00:00:00
2019-01-04 00:00:00
2019-01-05 00:00:00
2019-01-06 00:00:00
2019-01-07 00:00:00

In [17]:
table_data1 = {'A':[1,2,3,4,5],'B':[10,20,30,40,50],'C':[100,200,300,400,500]}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [18]:
table_data2 = {'A':[6,7,8],'B':[60,70,80],'C':[600,700,800]}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [19]:
df1+df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [24]:
df1 = pd.DataFrame({'Class1':[95,92,98,100],'Class2':[91,93,97,99]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [25]:
df2 = pd.DataFrame({'Class1':[87,89],'Class2':[85,90]})
df2

   Class1  Class2
0      87      85
1      89      90

In [26]:
df1.append(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [27]:
df1.append(df2,ignore_index=True)   #인덱스 정리

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [28]:
df3 = pd.DataFrame({'Class1':[96,83]})
df3

   Class1
0      96
1      83

In [29]:
df2.append(df3,ignore_index=True)

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

In [30]:
df1+df3

   Class1  Class2
0   191.0     NaN
1   175.0     NaN
2     NaN     NaN
3     NaN     NaN

In [31]:
df4 = pd.DataFrame({'Class3':[93,91,95,98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [32]:
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [36]:
index_label=['a','b','c','d']
df1a = pd.DataFrame({'Class1':[95,92,98,100],'Class2':[91,93,97,99]},index=index_label)
df4a = pd.DataFrame({'Class3':[93,91,95,98]},index=index_label)

df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [37]:
df5 = pd.DataFrame({'Class4':[82,92]})
df5

   Class4
0      82
1      92

In [39]:
df1.join(df5)

   Class1  Class2  Class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

In [44]:
df_A_B = pd.DataFrame({'판매월':['1월','2월','3월','4월'],'제품A':[100,150,200,130],'제품B':[90,110,140,170]})
df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [49]:
df_C_D = pd.DataFrame({'판매월':['1월','2월','3월','4월'],'제품C':[112,141,203,134],'제품D':[90,110,140,170]})
df_C_D

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

In [53]:
df_A_B.merge(df_C_D)  #중복된 column 반영, merge는 많이씀

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

In [54]:
df_left = pd.DataFrame({'key':['A','B','C'],'left':[1,2,3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [61]:
df_right = pd.DataFrame({'key':['A','B','D'],'right':[4,5,6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [62]:
df_left.merge(df_right, how='left',on='key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [63]:
df_left.merge(df_right, how='right',on='key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [64]:
df_left.merge(df_right, how='outer',on='key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [65]:
df_left.merge(df_right, how='inner',on='key')  # on : columns명

  key  left  right
0   A     1      4
1   B     2      5

In [ ]:
#inner와 outer 를 가장 많이 사용한다
#시간 data 많이 사용한다